Repository: giellalt/corpus-fin
Catalog: tmx/smn/admin/sd/www.samediggi.fi/puheenjohtajiston_katsaus_saamelaiskarajien_kokouksessa_22_6_2021.html.tmx
Source language: fin
Languages: smn

source: Päätös suojella 700 hehtaaria vanhaa ikimetsää tehtiin kesäkuussa, ja Saamelaiskäräjät on erittäin tyytyväinen päätökseen .
smn: Saavâjođetteijee Tuomas Aslak Juuso tuomas.juuso(at)samediggi.fi 040 687 3394 / 010 839 3101

source: Puheenjohtaja Tuomas Aslak Juuso tuomas.juuso(at)samediggi.fi 040 687 3394 / 010 839 3101
smn: I värisaavâjođetteijee Anni Koivisto anni.koivisto(at)samediggi.fi 040 415 5969

source: I varapuheenjohtaja Anni Koivisto anni.koivisto(at)samediggi.fi 040 415 5969
smn: II värisaavâjođetteijee Leo Aikio leo.aikio(at)samediggi.fi 040 621 6505 / 010 839 3180
